package choices;

import java.util.Arrays;
import java.util.List;

public class InterTestBoykoChoices {
    public static final List<String> AGGRESS = Arrays.asList(
            "проблемы не выявлены",
            "проблемы не выявлены",
            "средняя агрессивность",
            "сильная агрессивность",
            "очень сильная агрессивность"
    );
    public static final List<String> ALARM = Arrays.asList(
            "проблемы не выявлены",
            "проблемы не выявлены",
            "средняя тревога и депрессия",
            "сильная тревога и депрессия",
            "очень сильная тревога и депрессия"
    );
    public static final List<String> MEMORY_DISORDER = Arrays.asList(
            "проблемы не выявлены",
            "проблемы не выявлены",
            "средне выраженные нарушения памяти, мышления, внимания",
            "сильно выраженные нарушения памяти, мышления, внимания",
            "очень сильно выраженные нарушения памяти, мышления, внимания"
    );
    public static final List<String> CRITICISM = Arrays.asList(
            "проблемы не выявлены",
            "проблемы не выявлены",
            "поверхностное понимание своего положения",
            "сниженное понимание своего положения",
            "стойкая утрата понимания своего положения"
    );
    public static final List<String> SELF_SERVICE = Arrays.asList(
            "проблемы не выявлены",
            "проблемы не выявлены",
            "обслуживает себя минимально",
            "трудности самообслуживания",
            "не справляется с самообслуживанием"
    );
    public static final List<String> WORK_ACTIVITY = Arrays.asList(
            "проблемы не выявлены",
            "проблемы не выявлены",
            "выраженные проблемы на работе, но не приводящие к её потере",
            "серьёзные проблемы при работе, не позволяющие её сохранить",
            "нет работы, не способен её самостоятельно найти и выполнять"
    );
    public static final List<String> FRIENDS = Arrays.asList(
            "проблемы не выявлены",
            "проблемы не выявлены",
            "сужение контактов с людьми",
            "суженый круг общения, часты конфликты c окружающими",
            "отсутствие социальных связей"
    );
    public static final List<String> FAMILY_RELATION = Arrays.asList(
            "проблемы не выявлены",
            "проблемы не выявлены",
            "конфликтные отношения с родственниками",
            "серьёзные конфликты с родственниками, приводящие к разрывам отношений",
            "нет желания иметь/сохранять семью"
    );
    public static final List<String> CHILD_PARENT = Arrays.asList(
            "проблемы не выявлены",
            "проблемы не выявлены",
            "нестабильно проявляет заботу о детях",
            "недостаточно заботится о детях",
            "не заботится о детях"
    );
    public static final List<String> LEISURE = Arrays.asList(
            "проблемы не выявлены",
            "проблемы не выявлены",
            "бедная сфера интересов",
            "пассивный досуг (\"убивает время\")",
            "отсутствие досуга, всё время посвящено употреблению"
    );
    public static final List<String> OVERALL_ASSESSMENT = Arrays.asList(
            "нормализация клинических и социальных показателей, стабильное социальное функционирование",
            "частичная нормализация клинических и социальных показателей, средний уровень социального функционирования",
            "частичное улучшение клинических и социальных показателей, низкий уровень социального функционирования",
            "без изменений клинических и социальных показателей, крайне низкий уровень социального функционирования"
    );
}
